### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('ratings.csv')
data.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [14]:
id_f = data['movieId'].value_counts().head(1)

In [23]:
data2 = pd.read_csv('movies.csv')
data2.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [32]:
data3 = pd.merge(data[['movieId','rating']], data2[['movieId','title']], how='left', on=['movieId', 'movieId'])

In [33]:
data3[data3.rating == 5.0]['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    39553
Name: title, dtype: int64

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [37]:
data_energy = pd.read_csv('power.csv')
data_energy.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [40]:
data_energy[ data_energy['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [55]:
data_f = data_energy[((data_energy.country == 'Latvia') | (data_energy.country == 'Lithuania') | (data_energy.country == 'Estonia')) & (data_energy.year <= 2010) & (data_energy.year >= 2005) & (data_energy.quantity > 0) & ((data_energy.category == 4) | (data_energy.category == 12) | (data_energy.category == 21))]
data_f.quantity.sum()

240580.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes

In [60]:
page_url = 'https://fortrader.org/quotes'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url)

In [62]:
df[0].head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,EURRUB Курс евро к рублю сегодня,80.5835,-0.5778,-0.7119,NaN
1,USDRUB Курс рубля к доллару,71.1632,-0.5541,-0.7726,NaN